{
    "kind": "books#volume",
    "id": "zHH_uQEACAAJ",
    "etag": "wfZPrKkotp8",
    "selfLink": "https://www.googleapis.com/books/v1/volumes/zHH_uQEACAAJ",
    "volumeInfo": {
        "title": "Learn Robotics Programming",
        "authors": [
            "Danny Staple"
        ],
        "publishedDate": "2018-11-29",
        "description": "Gain experience of building a next-generation collaboration robot Key Features Get up and running with the fundamentals of robotic programming Program a robot using Python and the Raspberry Pi 3 Learn to build a smart robot with interactive and AI-enabled behaviors Book Description We live in an age where the most difficult human tasks are now automated. Smart and intelligent robots, which will perform different tasks precisely and efficiently, are the requirement of the hour. A combination of Raspberry Pi and Python works perfectly when making these kinds of robots. Learn Robotics Programming starts by introducing you to the basic structure of a robot, along with how to plan, build, and program it. As you make your way through the book, you will gradually progress to adding different outputs and sensors, learning new building skills, and writing code for interesting behaviors with sensors. You'll also be able to update your robot, and set up web, phone, and Wi-Fi connectivity in order to control it. By the end of the book, you will have built a clever robot that can perform basic artificial intelligence (AI) operations. What you will learn Configure a Raspberry Pi for use in a robot Interface motors and sensors with a Raspberry Pi Implement code to make interesting and intelligent robot behaviors Understand the first steps in AI behavior such as speech recognition visual processing Control AI robots using Wi-Fi Plan the budget for requirements of robots while choosing parts Who this book is for Learn Robotics Programming is for programmers, developers, and enthusiasts interested in robotics and developing a fully functional robot. No major experience required just some programming knowledge would be sufficient.",
        "industryIdentifiers": [
            {
                "type": "ISBN_10",
                "identifier": "1789340748"
            },
            {
                "type": "ISBN_13",
                "identifier": "9781789340747"
            }
        ],
        "readingModes": {
            "text": false,
            "image": false
        },
        "pageCount": 472,
        "printType": "BOOK",
        "categories": [
            "Computers"
        ],
        "maturityRating": "NOT_MATURE",
        "allowAnonLogging": false,
        "contentVersion": "preview-1.0.0",
        "panelizationSummary": {
            "containsEpubBubbles": false,
            "containsImageBubbles": false
        },
        "imageLinks": {
            "smallThumbnail": "http://books.google.com/books/content?id=zHH_uQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "thumbnail": "http://books.google.com/books/content?id=zHH_uQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
        },
        "language": "en",
        "previewLink": "http://books.google.co.uk/books?id=zHH_uQEACAAJ&dq=isbn:9781789340747&hl=&cd=1&source=gbs_api",
        "infoLink": "http://books.google.co.uk/books?id=zHH_uQEACAAJ&dq=isbn:9781789340747&hl=&source=gbs_api",
        "canonicalVolumeLink": "https://books.google.com/books/about/Learn_Robotics_Programming.html?hl=&id=zHH_uQEACAAJ"
    },
    "saleInfo": {
        "country": "GB",
        "saleability": "NOT_FOR_SALE",
        "isEbook": false
    },
    "accessInfo": {
        "country": "GB",
        "viewability": "NO_PAGES",
        "embeddable": false,
        "publicDomain": false,
        "textToSpeechPermission": "ALLOWED",
        "epub": {
            "isAvailable": false
        },
        "pdf": {
            "isAvailable": false
        },
        "webReaderLink": "http://play.google.com/books/reader?id=zHH_uQEACAAJ&hl=&printsec=frontcover&source=gbs_api",
        "accessViewStatus": "NONE",
        "quoteSharingAllowed": false
    },
    "searchInfo": {
        "textSnippet": "What you will learn Configure a Raspberry Pi for use in a robot Interface motors and sensors with a Raspberry Pi Implement code to make interesting and intelligent robot behaviors Understand the first steps in AI behavior such as speech ..."
    }
}