{
    "kind": "books#volume",
    "id": "8KESMQAACAAJ",
    "etag": "5q+15iEQYig",
    "selfLink": "https://www.googleapis.com/books/v1/volumes/8KESMQAACAAJ",
    "volumeInfo": {
        "title": "ROS Robotics Projects",
        "subtitle": "Build a Variety of Awesome Robots that Can See, Sense, Move, and Do a Lot More Using the Powerful Robot Operating System",
        "authors": [
            "Lentin Joseph"
        ],
        "publishedDate": "2017-03-31",
        "description": "Build a variety of awesome robots that can see, sense, move, and do a lot more using the powerful Robot Operating SystemAbout This Book* Create and program cool robotic projects using powerful ROS libraries* Work through concrete examples that will help you build your own robotic systems of varying complexity levels* This book provides relevant and fun-filled examples so you can make your own robots that can run and workWho This Book Is ForThis book is for robotic enthusiasts and researchers who would like to build robot applications using ROS. If you are looking to explore advanced ROS features in your projects, then this book is for you. Basic knowledge of ROS, GNU/Linux, and programming concepts is assumed.What You Will Learn* Create your own self-driving car using ROS* Build an intelligent robotic application using deep learning and ROS* Master 3D object recognition* Control a robot using virtual reality and ROS* Build your own AI chatter-bot using ROS* Get to know all about the autonomous navigation of robots using ROS* Understand face detection and tracking using ROS* Get to grips with teleoperating robots using hand gestures* Build ROS-based applications using Matlab and Android* Build interactive applications using TurtleBotIn DetailRobot Operating System is one of the most widely used software frameworks for robotic research and for companies to model, simulate, and prototype robots. Applying your knowledge of ROS to actual robotics is much more difficult than people realize, but this title will give you what you need to create your own robotics in no time!This book is packed with over 14 ROS robotics projects that can be prototyped without requiring a lot of hardware. The book starts with an introduction of ROS and its installation procedure. After discussing the basics, you'll be taken through great projects, such as building a self-driving car, an autonomous mobile robot, and image recognition using deep learning and ROS. You can find ROS robotics applications for beginner, intermediate, and expert levels inside!This book will be the perfect companion for a robotics enthusiast who really wants to do something big in the field.Style and approachThis book is packed with fun-filled, end-to-end projects on mobile, armed, and flying robots, and describes the ROS implementation and execution of these models.",
        "industryIdentifiers": [
            {
                "type": "ISBN_10",
                "identifier": "1783554711"
            },
            {
                "type": "ISBN_13",
                "identifier": "9781783554713"
            }
        ],
        "readingModes": {
            "text": false,
            "image": false
        },
        "pageCount": 452,
        "printType": "BOOK",
        "categories": [
            "Computers"
        ],
        "maturityRating": "NOT_MATURE",
        "allowAnonLogging": false,
        "contentVersion": "preview-1.0.0",
        "panelizationSummary": {
            "containsEpubBubbles": false,
            "containsImageBubbles": false
        },
        "imageLinks": {
            "smallThumbnail": "http://books.google.com/books/content?id=8KESMQAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "thumbnail": "http://books.google.com/books/content?id=8KESMQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
        },
        "language": "en",
        "previewLink": "http://books.google.co.uk/books?id=8KESMQAACAAJ&dq=isbn:9781783554713&hl=&cd=1&source=gbs_api",
        "infoLink": "http://books.google.co.uk/books?id=8KESMQAACAAJ&dq=isbn:9781783554713&hl=&source=gbs_api",
        "canonicalVolumeLink": "https://books.google.com/books/about/ROS_Robotics_Projects.html?hl=&id=8KESMQAACAAJ"
    },
    "saleInfo": {
        "country": "GB",
        "saleability": "NOT_FOR_SALE",
        "isEbook": false
    },
    "accessInfo": {
        "country": "GB",
        "viewability": "NO_PAGES",
        "embeddable": false,
        "publicDomain": false,
        "textToSpeechPermission": "ALLOWED",
        "epub": {
            "isAvailable": false
        },
        "pdf": {
            "isAvailable": false
        },
        "webReaderLink": "http://play.google.com/books/reader?id=8KESMQAACAAJ&hl=&printsec=frontcover&source=gbs_api",
        "accessViewStatus": "NONE",
        "quoteSharingAllowed": false
    },
    "searchInfo": {
        "textSnippet": "Build a variety of awesome robots that can see, sense, move, and do a lot more using the powerful Robot Operating SystemAbout This Book* Create and program cool robotic projects using powerful ROS libraries* Work through concrete examples ..."
    }
}