{
    "asset": "python microservices development",
    "page_detail": {
        "count": 340,
        "delta": 0
    },
    "pages": 340,
    "title": {
        "title_short": "Python Microservices Development",
        "subtitle": null,
        "description": "A practical approach to conquering the complexities of Microservices using the Python tooling ecosystemAbout This Book* A very useful guide for Python developers who are shifting to the new microservices-based development* A concise, up-to-date guide to building efficient and lightweight microservices in Python using Flask, Tox, and other tools* Learn to use Docker containers, CoreOS, and Amazon Web Services to deploy your servicesWho This Book Is ForThis book is for developers who have basic knowledge of Python, the command line, and HTTP-based application principles, and those who want to learn how to build, test, scale, and manage Python 3 microservices. No prior experience of writing microservices in Python is assumed.What You Will Learn* Explore what microservices are and how to design them* Use Python 3, Flask, Tox, and other tools to build your services using best practices* Learn how to use a TDD approach* Discover how to document your microservices* Configure and package your code in the best way* Interact with other services* Secure, monitor, and scale your services* Deploy your services in Docker containers, CoreOS, and Amazon Web ServicesIn DetailWe often deploy our web applications into the cloud, and our code needs to interact with many third-party services. An efficient way to build applications to do this is through microservices architecture. But, in practice, it's hard to get this right due to the complexity of all the pieces interacting with each other.This book will teach you how to overcome these issues and craft applications that are built as small standard units, using all the proven best practices and avoiding the usual traps. It's a practical book: you'll build everything using Python 3 and its amazing tooling ecosystem. You will understand the principles of TDD and apply them.You will use Flask, Tox, and other tools to build your services using best practices. You will learn how to secure connections between services, and how to script Nginx using Lua to build web application firewall features such as rate limiting. You will also familiarize yourself with Docker's role in microservices, and use Docker containers, CoreOS, and Amazon Web Services to deploy your services.This book will take you on a journey, ending with the creation of a complete Python application based on microservices. By the end of the book, you will be well versed with the fundamentals of building, designing, testing, and deploying your Python microservices.Style and approachThis book is an linear, easy-to-follow guide on how to best design, write, test, and deploy your microservices. It includes real-world examples that will help Python developers create their own Python microservice using the most efficient methods.",
        "title_long": "Python Microservices Development: Build, Test, Deploy, And Scale Microservices In Python",
        "synopsys": null,
        "title": "Python Microservices Development: Build, Test, Deploy, And Scale Microservices In Python"
    },
    "isbn": "1785881116",
    "isbn13": "9781785881114",
    "authors": [
        "Tarek Ziade"
    ],
    "publisher": [
        "Packt Publishing"
    ],
    "categories": [
        "Python (Computer program language)"
    ],
    "rating": 4.0,
    "rating_count": -1,
    "images": {
        "image": "https://images.isbndb.com/covers/11/14/9781785881114.jpg",
        "smallThumbnail": "http://books.google.com/books/content?id=zzaltAEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
        "thumbnail": "http://books.google.com/books/content?id=zzaltAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    "cost": 44.99,
    "publish_date": "2017-07-24",
    "files": [],
    "image": "1785881116.jpg"
}