{
    "asset": "Python Robotics Projects",
    "page_detail": {
        "count": 340,
        "delta": 0
    },
    "pages": 340,
    "title": {
        "title_short": "Python Robotics Projects",
        "subtitle": null,
        "description": "Leverage the power of Python to build DIY robotic projects Key Features Design, build, and stimulate collaborative robots Build high-end robotics projects such as a customized personal Jarvis Leverage the power of Python and ROS for DIY robotic projects Book Description Robotics is a fast-growing industry. Multiple surveys state that investment in the field has increased tenfold in the last 6 years, and is set to become a $100-billion sector by 2020. Robots are prevalent throughout all industries, and they are all set to be a part of our domestic lives. This book starts with the installation and basic steps in configuring a robotic controller. You'll then move on to setting up your environment to use Python with the robotic controller. You'll dive deep into building simple robotic projects, such as a pet-feeding robot, and more complicated projects, such as machine learning enabled home automation system (Jarvis), vision processing based robots and a self-driven robotic vehicle using Python. By the end of this book, you'll know how to build smart robots using Python. What you will learn Get to know the basics of robotics and its functions Walk through interface components with microcontrollers Integrate robotics with the IoT environment Build projects using machine learning Implement path planning and vision processing Interface your robots with Bluetooth Who this book is for If building robots is your dream, then this book is made for you. Prior knowledge of Python would be an added advantage.",
        "title_long": "Python Robotics Projects: Build Smart And Collaborative Robots Using Python",
        "synopsys": null,
        "title": "Python Robotics Projects: Build Smart And Collaborative Robots Using Python"
    },
    "isbn": "1788832922",
    "isbn13": "9781788832922",
    "authors": [
        "Diwakar Vaish",
        "Prof. Diwakar Vaish"
    ],
    "publisher": [
        "Packt Publishing"
    ],
    "categories": [
        "Computers"
    ],
    "rating": -1,
    "rating_count": -1,
    "images": {
        "image": "https://images.isbndb.com/covers/29/22/9781788832922.jpg",
        "smallThumbnail": "http://books.google.com/books/content?id=ZJDBtQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
        "thumbnail": "http://books.google.com/books/content?id=ZJDBtQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    "cost": 44.99,
    "publish_date": "2018",
    "files": [],
    "image": "1788832922.jpg"
}