{
    "asset": "ESP8266 Home Automation Projects",
    "page_detail": {
        "count": 196,
        "delta": 0
    },
    "pages": 196,
    "title": {
        "title_short": "ESP8266 Home Automation Projects",
        "subtitle": null,
        "description": "Unleash the power of the ESP8266 and build a complete home automation system with it.About This Book* Harness the power of the ESP8266 Wi-Fi chip to build an effective Home Automation System* Learn about the various ESP8266 modules* Configuring the ESP8266 and making interesting home automation projects* A step-by-step guide on the ESP8266 chip and how to convert your home into a smart home.Who This Book Is ForThis book is targeted at people who want to build connected and inexpensive home automation projects using the ESP8266 Wi-Fi chip, and to completely automate their homes. A basic understanding of the board would be an added advantageWhat You Will Learn* Get, compile, install, and configure an MQTT server* Use the Wi-Fi connectivity feature to control appliances remotely* Control several home appliances using the ESP8266 Wi-Fi chip* Control and monitor your home from the cloud using ESP8266 modules* Stream real-time data from the ESP8266 to a server over WebSockets* Create an Android mobile application for your projectIn DetailThe ESP8266 is a low-cost yet powerful Wi-Fi chip that is becoming more popular at an alarming rate, and people have adopted it to create interesting projects.With this book, you will learn to create and program home automation projects using the ESP8266 Wi-Fi chip. You will learn how to build a thermostat to measure and adjust the temperature accordingly and how to build a security system using the ESP8266. Furthermore, you will design a complete home automation system from sensor to your own cloud. You will touch base on data monitoring, controlling appliances, and security aspects.By the end of the book, you will understand how to completely control and monitor your home from the cloud and from a mobile application. You will be familiar with the capabilities of the ESP8266 and will have successfully designed a complete ready-to-sell home automated system.Style and approachA practical book that will cover independent home automation projects.",
        "title_long": "Esp8266 Home Automation Projects: Leverage The Power Of This Tiny Wifi Chip To Build Exciting Smart Home Projects",
        "synopsys": "Catalin Batrinu.",
        "title": "Esp8266 Home Automation Projects: Leverage The Power Of This Tiny Wifi Chip To Build Exciting Smart Home Projects"
    },
    "isbn": "1787282627",
    "isbn13": "9781787282629",
    "authors": [
        "Catalin Batrinu"
    ],
    "publisher": [
        "Packt Publishing"
    ],
    "categories": [
        "Computers"
    ],
    "rating": -1,
    "rating_count": -1,
    "images": {
        "image": "https://images.isbndb.com/covers/26/29/9781787282629.jpg",
        "smallThumbnail": "http://books.google.com/books/content?id=SmpMtAEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
        "thumbnail": "http://books.google.com/books/content?id=SmpMtAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    "cost": 34.99,
    "publish_date": "2017",
    "files": [],
    "image": "1787282627.jpg"
}